{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Masking", "config": {"mask_value": -1, "dtype": "float32", "name": "masking_1", "batch_input_shape": [null, 5, 34], "trainable": true}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_constraint": null, "trainable": true, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "units": 32, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dropout": 0.0, "implementation": 0, "return_state": false, "name": "lstm_1", "bias_constraint": null, "recurrent_regularizer": null, "go_backwards": false}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 18, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_1", "activation": "linear", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}